import Images from "../images/Images";

export const compaines = [
  {
    name: "TADIRAN",
    logo: Images.Tadiran(),
  },
  {
    name: "electra",
    logo: Images.Electra(),
  },
  {
    name: "samsung",
    logo: Images.Family(),
  },
  {
    name: "Haier",
    logo: Images.Haier(),
  },
  {
    name: "Samsung",
    logo: Images.Samsung(),
  },
  {
    name: "Tornado",
    logo: Images.Tornado(),
  },
];

export const data = [
  {
    brand: "TADIRAN on/off /INVERTER/MULTI INVERTER/VRF",
    image: Images.Tadiran(),
  },
  {
    brand: "electra on/off /INVERTER/MULTI INVERTER/VRF",
    image: Images.Electra(),
  },
  {
    brand: "samsung on/off /INVERTER/MULTI INVERTER/VRF",
    image: Images.Samsung(),
  },
  {
    brand: "Haier on/off /INVERTER/MULTI INVERTER/VRF",
    image: Images.Haier(),
  },
  {
    brand: "Tornado on/off /INVERTER/MULTI INVERTER/VRF",
    image: Images.Tornado(),
  },
  {
    brand: "Family on/off /INVERTER/MULTI INVERTER/VRF",
    image: Images.Family(),
  },
  {
    brand: ["TADIRAN"],
    tech: "on/off",
    model: [
      "10i",
      "15i",
      "18i",
      "21i",
      "28i",
      "32i",
      "35i",
      "35i/3",
      "42i",
      "42i/3",
      "top10a",
      "top15a",
      "10a",
      "15a",
      "18a",
      "21a",
      "32a",
      "35a",
      "35a/3",
    ],
    errorCode: "e1",
    errorMessage: "הגנה מפני לחץ גבוה",
    errorDescription: `הכרטיס הראשי ולוח התצוגה אינם מחוברים בצורה תקינה
מגע OVC בכרטיס הראשי אינו מחובר למתג הלחץ הגבוה ביחידה
חיווט מתג הלחץ הגבוה מחובר בצורה רופפת
עודף קרר;
החלפת חום לקויה (מחליף חום חסום והקרנה לא יעילה לסביבה);
טמפרטורת הסביבה גבוהה מידי בקירור (במקרה של יחידה תלת-פאזית, ייתכן שהגנת הלחץ הגבוה הופעלה על-ידי הגנת זרם יתר עקב סיבה זו)
מתח זינה לא תקין (במקרה של יחידה תלת-פאזית, ייתכן שהגנת הלחץ הגבוה הופעלה על-ידי הגנת זרם יתר עקב סיבה זו)
יניקת האוויר ופליטת האוויר במחליף החום הפנימי או החיצוני אינן תקינות. נוצר "קצר אויר" בחימום
סתימה במסנן האוויר ובצלעות של מחליף החום ביחידה החיצונית או הפנימית
סתימה בצנרת המערכת
ברז הגז וברז הנוזל של היחידה החיצונית אינם פתוחים לחלוטין
צריכת זרם גבוהה – OVC (מגן יתרת הזרם)`,
  },
  {
    brand: ["TADIRAN"],
    tech: "on/off",
    model: [
      "10i",
      "15i",
      "18i",
      "21i",
      "28i",
      "32i",
      "35i",
      "35i/3",
      "42i",
      "42i/3",
      "top10a",
      "top15a",
      "10a",
      "15a",
      "18a",
      "21a",
      "32a",
      "35a",
      "35a/3",
    ],
    errorCode: "e2",
    errorMessage: " הגנה מפני קפיאה",
    errorDescription: `חזרת אוויר לקויה ביחידה הפנימית;
מהירות מאוורר לא תקינה;
לכלוך במאדה;
המערכת תקינה, אך רגש טמפרטורת הצינור של היחידה הפנימית אינו תקין, או שרגש טמפרטורת הצינור מחובר בצורה לקויה`,
  },
  {
    brand: ["TADIRAN"],
    tech: "on/off",
    model: [
      "10i",
      "15i",
      "18i",
      "21i",
      "28i",
      "32i",
      "35i",
      "35i/3",
      "42i",
      "42i/3",
      "top10a",
      "top15a",
      "10a",
      "15a",
      "18a",
      "21a",
      "32a",
      "35a",
      "35a/3",
    ],
    errorCode: "e3",
    errorMessage: "הגנת מדחס מפני לחץ נמוך ",
    errorDescription: `הכרטיס הראשי ולוח התצוגה אינם מחוברים בצורה תקינה
מגע LPP (פרסוסטט לחץ נמוך) בכרטיס הראשי מחובר בצורה רופפת למתג הלחץ הנמוך ביחידה
חיווט מתג הלחץ הנמוך מחובר בצורה רופפת. מתג הלחץ הנמוך מקולקל או מחובר בצורה לקויה.
חוסר או דליפה של קרר`,
  },
  {
    brand: ["TADIRAN"],
    tech: "on/off",
    model: [
      "10i",
      "15i",
      "18i",
      "21i",
      "28i",
      "32i",
      "35i",
      "35i/3",
      "42i",
      "42i/3",
      "top10a",
      "top15a",
      "10a",
      "15a",
      "18a",
      "21a",
      "32a",
      "35a",
      "35a/3",
    ],
    errorCode: "e4",
    errorMessage: "הגנת מדחס מפני טמפרטורת פליטה גבוהה",
    errorDescription: `תקלה במערכת (כגון: סתימה)
מהירות מאוורר היחידה החיצונית לא תקינה (קירור)
כניסת אוויר לא תקינה (קירור)
המערכת תקינה, אך רגש הטמפרטורה ביציאה מהמדחס אינו תקין או מחובר בצורה לקויה
חוסר גז במערכת`,
  },
  {
    brand: ["TADIRAN"],
    tech: "on/off",
    model: [
      "10i",
      "15i",
      "18i",
      "21i",
      "28i",
      "32i",
      "35i",
      "35i/3",
      "42i",
      "42i/3",
      "top10a",
      "top15a",
      "10a",
      "15a",
      "18a",
      "21a",
      "32a",
      "35a",
      "35a/3",
    ],
    errorCode: "e5",
    errorMessage: "הגנת זרם יתר	",
    errorDescription: `מתח זינה לא יציב. השינויים יהיו בטווח של 10% של המתח הנקוב המצוין בלוחית הנתונים
מתח הזינה נמוך מידי, והעומס גבוה מידי
מדוד את הזרם בחוטים המוליכים בכרטיס הראשי. אם הזרם אינו גבוה מהערך של הגנת זרם יתר, בדוק את הפיקוד
מחליפי החום הפנימי והחיצוני מלוכלכים או שכניסת האוויר ויציאת האוויר חסומות
מנוע המאוורר אינו פועל. מהירות מאוורר לא תקינה: מהירות המאוורר נמוכה מידי או שהמאוורר אינו פועל
המדחס אינו פועל בצורה תקינה. רעש חריג, דליפת שמן או שטמפרטורת המעטפת החיצונית גבוהה מידי
סתימה במערכת, גוש קרח, סתימה שומנית, ברז Y לא פתוח לחלוטין`,
  },
  {
    brand: ["TADIRAN"],
    tech: "on/off",
    model: [
      "10i",
      "15i",
      "18i",
      "21i",
      "28i",
      "32i",
      "35i",
      "35i/3",
      "42i",
      "42i/3",
      "top10a",
      "top15a",
      "10a",
      "15a",
      "18a",
      "21a",
      "32a",
      "35a",
      "35a/3",
    ],
    errorCode: "e6",
    errorMessage: "תקלת תקשורת	",
    errorDescription: `קו התקשורת מחובר בתצורה לקויה. מגע לקוי בכל אחד מהקווים עלול לגרום לתקלת תקשורת
אין התאמה בין הכרטיס הראשי לבין כרטיס התצוגה. התאמה לקויה בין הכרטיס הראשי לבין הכרטיס של התצוגה
חיבור חוט לקוי
הפיקוד מקולקל
דגמים תלת פאזיים בדוק סדר פאזות , חוסר פאזה`,
  },
  {
    brand: ["TADIRAN"],
    tech: "on/off",
    model: [
      "10i",
      "15i",
      "18i",
      "21i",
      "28i",
      "32i",
      "35i",
      "35i/3",
      "42i",
      "42i/3",
      "top10a",
      "top15a",
      "10a",
      "15a",
      "18a",
      "21a",
      "32a",
      "35a",
      "35a/3",
    ],
    errorCode: "e8",
    errorMessage: "תקלת רגש סוללה",
    errorDescription: `בדוק תקינות רגשים לפי טבלת ערכי רגשים כללי`,
  },
  {
    brand: ["electra"],
    tech: "on/off",
    model: [],
    errorCode: "e1",
    errorMessage: "תקלת רגש סוללה",
    errorDescription: "",
  },
];
